Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can also select all the views you want to align, and then click Align in the toolbar to select the alignment type.
zh_cn: 你还可以选择所有要对齐的 view，然后单击工具栏中的 Align 来选择对齐方式。

source: You can also specify gravity, which specifies the alignment of all the child elements by calling setGravity() or specify that specific children grow to fill up any remaining space in the layout by setting the weight member of LinearLayoutCompat.LayoutParams.
zh_cn: 你还可以通过调用 setGravity() 指定重力，指定所有子元素的对齐方式，或者指定特定子项增长以填充布局中的任何剩余空间，通过设置 LinearLayoutCompat.LayoutParams 的 weight 成员。

source: You can also use a color resource when a drawable resource is expected in XML (for example, android:drawable="@color/green").
zh_cn: 当 XML 中需要可绘制资源时，你也可以使用颜色资源(例如，android:drawable="@color/green")。

source: You can also use an alternative, mobile-friendly library to add specific functionality to your app.
zh_cn: 你还可以使用其他适合移动设备的库来为你的应用添加特定功能。

source: You can also use ratio if both dimensions are set to MATCH_CONSTRAINT (0dp).
zh_cn: 如果两个尺寸均设置为 MATCH_CONSTRAINT (0dp)，也可以使用比例。

source: You can attach an Animation object to a view using setAnimation(Animation) or startAnimation(Animation).
zh_cn: 你可以给 view 附加一个 Animation 对象，用 setAnimation(Animation) 或 startAnimation(Animation) 方法。

source: You can attach an Animation object to a view using setAnimation(android.view.animation.Animation) or startAnimation(android.view.animation.Animation).
zh_cn: 你可以给 view 附加一个 Animation 对象，用 setAnimation(android.view.animation.Animation) 或 startAnimation(android.view.animation.Animation) 方法。

source: You can build this yourself by manually calling adapter.notify* methods when content changes, or you can use one of the easier solutions RecyclerView provides:
zh_cn: 你可以在内容更改时手动调用 adapter.notify* 方法自行构建，也可以使用 RecyclerView 提供的更简单的解决方案之一：

source: You can change it by providing a custom GridLayoutManager.SpanSizeLookup instance via setSpanSizeLookup(SpanSizeLookup).
zh_cn: 你可以改变它通过提供自定义的 GridLayoutManager.SpanSizeLookup 实例，通过 setSpanSizeLookup(SpanSizeLookup)。

source: You can change the way the height and width are calculated by clicking the symbols indicated with callout 3 in figure 10.
zh_cn: 你可以通过单击图 10 中标注 3 所示的符号来更改计算高度和宽度的方式。

source: You can change this via setContentScrim(Drawable).
zh_cn: 你可以通过 setContentScrim(Drawable) 更改此设置。

source: You can change this via setStatusBarScrim(Drawable).
zh_cn: 你可以通过 setStatusBarScrim(Drawable) 更改此设置。

source: You can choose any alias you want for your namespace.
zh_cn: 你可以为命名空间选择所需的任何别名。

source: You can constrain a widget on the horizontal and vertical axis:
zh_cn: 你可以在水平和垂直轴上约束小部件：

source: You can control the format of this surface and, if you like, its size; the SurfaceView takes care of placing the surface at the correct location on the screen
zh_cn: 你可以控制此 surface 的格式，如果你愿意，也可以控制其大小；SurfaceView 负责将 surface 放置在屏幕上的正确位置

source: You can control this behavior via setGapStrategy(int).
zh_cn: 你可以通过 setGapStrategy(int) 控制这种行为。

source: You can convert existing BMP, JPG, PNG or static GIF images to WebP format using Android Studio.
zh_cn: 你可以使用 Android Studio 将现有的 BMP，JPG，PNG 或静态 GIF 图像转换为 WebP 格式。

source: You can convert individual images or folders of images.
zh_cn: 你可以转换图像的单个图像或文件夹。

source: You can create constraints only between a constraint handle and an anchor point that share the same plane.
zh_cn: 只能在共享的同一平面的约束句柄和锚点之间创建约束。

source: You can define the distance from the edge with margin.
zh_cn: 你可以使用 margin 定义到边缘的距离。

source: You can do all of the things you would do with a fully customized component, but by starting with a more specialized class in the View hierarchy, you can also get a lot of behavior for free that probably does exactly what you want.
zh_cn: 一个完全自定义的可以做的，继承一个更特定的 view 也可以做，而且你还能免费获得更多的行为，也许正是你想要的行为。

source: You can drag the slider left or right to change the quality setting and immediately see the effect on the encoded image and the file size.
zh_cn: 你可以向左或向右拖动滑块以更改质量设置，并立即看到对编码图像和文件大小的影响。

source: You can either create a new View manually or inflate it from an XML layout file.
zh_cn: 可以手动创建新 View，也可以从一个 XML 布局文件中加载。

source: You can either use the factory to create the views, or add them yourself.
zh_cn: 你可以使用工厂创建 view，也可以自己添加它们。

source: You can find examples of using ViewPager in the API 4+ Support Demos and API 13+ Support Demos sample code.
zh_cn: 你可以在 API 4+ 支持演示和 API 13+ 支持演示示例代码中找到使用 ViewPager 的示例。

source: You can generally acquire the Resources instance associated with your application with getResources().
zh_cn: 你通常可以使用 getResources() 获取与你的应用程序关联的 Resources 实例。

source: You can give it a start time in the SystemClock#elapsedRealtime timebase, and it counts up from that, or if you don't give it a base time, it will use the time at which you call start().
zh_cn: 你可以在 SystemClock#elapsedRealtime 时基中给它一个开始时间，并从中计算，或者如果你没有给它一个基准时间，它将使用它你调用 start() 的时间。

source: You can have as many stretchable sections as you want: their relative size stays the same, so the largest sections always remain the largest.
zh_cn: 你可以有任意多的可伸缩部分，它们的将保持相对的大小，所以最大的部分始终是最大的。

source: You can include a separate resource for variations of an image, such as tinted, shaded, or rotated versions of the same image.
zh_cn: 你可以为图像的变体添加单独的资源，例如同一图像的着色，着色或旋转版本。

source: You can offset the alignment by dragging the view inward from the constraint.
zh_cn: 你可以通过从视图向内拖动约束来偏移对齐。

source: You can often diagnose this problem by observing a slow response when a user launches your app.
zh_cn: 你通常可以在用户启动应用时观察响应缓慢来诊断此问题。

source: You can perform layout of your inner UI elements to account for non-fullscreen system UI through the fitSystemWindows(Rect) method.
zh_cn: 你可以通过 fitSystemWindows(Rect) 方法执行内部 UI 元素的布局以考虑非全屏系统 UI。

source: You can perform layout of your inner UI elements to account for the navigation system UI through the fitSystemWindows(Rect) method.
zh_cn: 你可以通过 fitSystemWindows(Rect) 方法执行内部 UI 元素的布局以考虑导航系统 UI。

source: You can position the guideline within the layout based on either dp units or percent, relative to the layout's edge.
zh_cn: 你可以根据相对于布局边缘的 dp 单位或者百分百在布局中定位参考线。

source: You can reduce PNG file sizes without losing image quality using tools like pngcrush, pngquant, or zopflipng.
zh_cn: 你可以使用 pngcrush，pngquant 或 zopflipng 等工具减少 PNG 文件大小而不会丢失图像质量。

source: You can register a listener on the close icon with setOnCloseIconClickListener(OnClickListener).
zh_cn: 你可以使用 setOnCloseIconClickListener(OnClickListener) 在关闭图标上注册一个监听器。

source: You can register a listener on the main chip with setOnClickListener(OnClickListener) or setOnCheckedChangeListener(OnCheckedChangeListener).
zh_cn: 你可以使用 setOnClickListener(OnClickListener) 或 setOnCheckedChangeListener(OnCheckedChangeListener) 在主 chip 上注册监听器。

source: You can register such a listener using setOnFocusChangeListener(android.view.View.OnFocusChangeListener).
zh_cn: 你可以注册这样一监听器，使用 setOnFocusChangeListener(android.view.View.OnFocusChangeListener)。

source: You can rely on these positions to be consistent with what user is currently seeing on the screen.
zh_cn: 你可以依赖这些位置, 这些位置与用户当前在屏幕上看到的位置是一致的。

source: You can see some sample usages of the LabelView custom View in custom_view_1.xml from the samples.
zh_cn: 你可在示例中的 custom_view_1.xml 文件中看到一些使用示例。

source: You can send the content URI returned by getUriForFile() to another app in an Intent.
zh_cn: 你可以将由 getUriForFile() 返回的 content URI 放到 Intent 中发送给其他应用程序。

source: You can set android:layout_weight on individual child views to specify how linear layout divides remaining space amongst the views it contains.
zh_cn: 你可以在各个子 view 上设置 android:layout_weight，以指定线性布局如何在其包含的 view 之间划分剩余空间。

source: You can set the title to display via setTitle(CharSequence).
zh_cn: 你可以通过 setTitle(CharSequence) 设置要显示的标题。

source: You can set the view size to a ratio such as 16:9 if at least one of the view dimensions is set to "match constraints" (0dp).
zh_cn: 如果至少有一个 view 尺寸设置为 "match constraints" (0dp)，则可以将 view 大小设置为比例，例如 16:9。

source: You can specify the layout using the declarative XML files just like with an activity screen, or you can create views programmatically and nest them into the layout from your code.
zh_cn: 就像 Activity 一样，你可以在 XML 文件中申明布局，也可以通过编程的方式用代码嵌套。

source: You can supply a constructor which can take attributes and parameters from the XML, and you can also consume your own such attributes and parameters (perhaps the color and range of the VU meter, or the width and damping of the needle, etc.)
zh_cn: 你可以提供一个构造方法来从 XML 文件中获取属性和参数，你也可以使用这些属性和参数(比如 VU 表范围的颜色，指针的宽度和阻尼等)。

source: You can then adjust the whole chain's bias (left/right or up/down) by changing the chain's head view bias.
zh_cn: 然后，你可以通过更改链头 view 的偏差来调整整个链的偏差(左/右或上/下)。

source: You can then run your own custom gesture-detection code.
zh_cn: 然后，你可以运行自己的自定义手势检测代码。

source: You can update the percentage of progress displayed by using the setProgress(int) method, or by calling incrementProgressBy(int) to increase the current progress completed by a specified amount.
zh_cn: 你可以使用 setProgress(int) 方法更新显示的进度百分比，或者通过调用 incrementProgressBy(int) 以指定的金额增加当前完成的进度。

source: You can use a color resource any place that accepts a hexadecimal color value.
zh_cn: 你可以在任何接受十六进制颜色值的地方使用颜色资源。

source: You can use constraints to achieve different types of layout behavior, as described in the following sections.
zh_cn: 你可以使用约束来实现不同类型的布局行为，如一下各章节所述。

source: You can use method tracing or inline tracing to try to diagnose the problem.
zh_cn: 你可以使用方法跟踪或内联跟踪来尝试诊断问题。

source: You can use scrollers (Scroller or OverScroller) to collect the data you need to produce a scrolling animation—for example, in response to a fling gesture.
zh_cn: 你可以使用 scroller(Scroller 或 OverScroller)来收集生成滚动动画所需的数据。例如，响应一个 fling 手势。

source: You can use the reportFullyDrawn() method to measure the elapsed time between application launch and complete display of all resources and view hierarchies.
zh_cn: 你可以使用 reportFullyDrawn() 方法来度量应用程序启动和完全显示所有资源和视图层次结构之间所用的时间。

source: You can use the activity's windowBackground theme attribute to provide a simple custom drawable for the starting activity.
zh_cn: 你可以使用 activity 的 windowBackground 主题属性为起始 activity 提供简单的自定义 drawable。

source: You can use the corner handles to resize a view, but this hard codes the size so the view will not resize for different content or screen sizes.
zh_cn: 你可以使用拐角手柄来调整 view 大小，但这样会硬编码大小，因此 view 不会调整为不同的内容或屏幕尺寸大小。

source: You can use these methods in onDraw() to create your custom user interface (UI).
zh_cn: 你可以在 onDraw() 中使用这些方法来创建自定义用户界面(UI)。

source: You can use this class to access your application's resources.
zh_cn: 你可以使用此类访问应用程序的资源。

source: You can use this method to find the current offsets of the x and y coordinates, for example:
zh_cn: 你可以使用此方法查找 x 和 y 坐标的当前偏移量，例如：

source: You can use this to create an array of other resources, such as drawables.
zh_cn: 你可以使用它来创建其他资源的数组，例如 drawable。

source: You can use vector graphics to create resolution-independent icons and other scalable media.
zh_cn: 你可以使用矢量图形来创建与分辨率无关的图标和其他可伸缩媒体。

source: You can't share a single file by its file name, nor can you specify a subset of files using wildcards.
zh_cn: 你不能按文件名共享单个文件，也不能使用通配符指定文件的子集。

source: You can, however, add multiple children to a FrameLayout and control their position within the FrameLayout by assigning gravity to each child, using the android:layout_gravity attribute.
zh_cn: 但是，你可以使用 android:layout_gravity 属性，通过为每个子项分配重力，将多个子项添加到 FrameLayout 并控制它们在 FrameLayout 中的位置。

source: You could capture other events like key presses and handle them in some custom way (such as for a game).
zh_cn: 你可以捕获其他事件，比如按键，并且自己处理事件(比如在游戏中)。

source: You could combine a group of View components into a new single component, perhaps to make something like a ComboBox (a combination of popup list and free entry text field), a dual-pane selector control (a left and right pane with a list in each where you can re-assign which item is in which list), and so on.
zh_cn: 你可以用一组 View 组件组成一个新的单一组件，比如类似于一个 ComboBox（弹出窗口列表和一个自由输入的文本框的组合）、一个双窗口的选择控制器（左右窗口各有一个列表，你可以重新分配哪些 item 是在所选列表中）等等。（译注：第二个比如日类似日期、时间选择的那种）。

source: You could combine a group of View components into a new single component, perhaps to make something like a ComboBox (a combination of popup list and free entry text field), a dual-pane selector control (a left and right pane with a list in each where you can reassign which item is in which list), and so on.
zh_cn: 你可以用一组 View 组件组成一个新的单一组件，比如类似于一个 ComboBox（弹出窗口列表和一个自由输入的文本框的组合）、一个双窗口的选择控制器（左右窗口各有一个列表，你可以重新分配哪些 item 是在所选列表中）等等。（译注：第二个比如日类似日期、时间选择的那种）。

source: You could create a completely custom-rendered View type, for example a "volume control" knob rendered using 2D graphics, and which resembles an analog electronic control.
zh_cn: 你可以创建完全自己渲染的 View 类，比如一个用 2D 图呈现的 "音量控制" 旋扭。

source: You could override the way that an EditText component is rendered on the screen (the Notepad Tutorial uses this to good effect to create a lined notepad page).
zh_cn: 你可以重写 EditText 在屏幕上呈现的方式(Notepad Tutorial 使用这点创建一个按行排的记事本，效果良好)。

source: You could override the way that an EditText component is rendered on the screen (the Notepad Tutorial uses this to good effect, to create a lined-notepad page).
zh_cn: 你可以重写 EditText 在屏幕上呈现的方式(Notepad Tutorial 使用这点创建一个按行排的记事本，效果良好)。

source: You create tabs via newTab().
zh_cn: 你可以通过 newTab() 创建标签。

source: You define how to order items, and it will automatically trigger update signals that RecyclerView can use.
zh_cn: 你可以定义如何排序项目，它将自动触发 RecyclerView 可以使用的更新信号。

source: You do not need to override all of these methods.
zh_cn: 你不需要重写所有的方法。

source: You do not need to write Javadoc for trivial get and set methods such as setFoo() if all your Javadoc would say is "sets Foo".
zh_cn: 对于普通的 get 和 set 方法(如 setFoo())，你无需编写 Javadoc，要写也不过是 "设置 Foo"。

source: You have to invalidate the view after any change to its properties that might change its appearance, so that the system knows that it needs to be redrawn.
zh_cn: 在对可能更改其外观的属性进行任何更改后，必须使 view 无效，以便系统知道需要重新绘制该 view。

source: You indicate a stretchable section by drawing one (or more) 1-pixel-wide black line(s) in the left and top part of the border (the other border pixels should be fully transparent or white).
zh_cn: 你可以通过在左边框或上边框，画一段或多段 1 像素宽的黑线，来指明可伸缩的部分。（其他的边框像素应该完全透明或是白色）。

source: You just need to make sure to check the current API level at runtime, and omit the calls to the view animation system if the current level is less than 11.
zh_cn: 你只需确保在运行时检查当前 API 级别，如果当前级别小于 11，则忽略对 view 动画系统的调用。

source: You may otherwise add the action bar by calling requestFeature(FEATURE_SUPPORT_ACTION_BAR) or by declaring it in a custom theme with the windowActionBar property.
zh_cn: 你可以添加操作栏，通过调用 requestFeature(FEATURE_SUPPORT_ACTION_BAR) 或在自定义主题中使用 windowActionBar 属性。

source: You may wish to theme your app’s loading experience, so that the app’s launch screen is thematically consistent with the rest of the app, instead of with the system theming.
zh_cn: 你可能希望主题化应用程序的加载体验，以便应用程序的启动屏幕与应用程序的其余部分主题一致，而不是系统主题。

source: You might also create your own properties with accessors and modifiers, for example, allow the EditText value to be set initially in the component and query for its contents when needed.
zh_cn: 你也可以创建你自己属性的访问和修改方法，比如允许设置 EditText 的初始值获当需要时获取它的内容。（译注：allow the EditText value to be set initially in the component and query for its contents when needed，我也不知道是获取初始值的内容还是 EditText 的内容，反正影响不大。）。

source: You might call this object to iterate the list of tabs, or to tweak the layout of the tab list, but most methods should be called on the containing TabHost object.
zh_cn: 你可以调用此对象来迭代选项卡列表，或者调整选项卡列表的布局，但是应该在包含 TabHost 对象上调用大多数方法。

source: You might need to make some adjustments to be sure the layout responds as you intend for different screen sizes and orientations.
zh_cn: 你可能需要进行一些调整，以确保布局响应你打算为不同的屏幕尺寸和方向。

source: You might override other on... methods, like onKeyDown(), to perhaps choose certain default values from the popup list of a combo box when a certain key is pressed.
zh_cn: 你可能要重写一些 on... 方法，比如重写 onKeyDown() 方法，当某个按键按下时，从 combo box 的 popup list 中选择某个值。

source: You must always be on the UI thread when calling any method on any view. If you are doing work on other threads and want to update the state of a view from that thread, you should use a Handler.
zh_cn: 你必须在主线程调用任何 view 的任何方法。如果你在其他线程工作并想在那个线程更新 view 的状态，应该使用 Handler。

source: You must call getSupportFragmentManager() to get the FragmentManager
zh_cn: 你必须调用 getSupportFragmentManager() 以获得 FragmentManager。

source: You must ensure that the drawing thread only touches the underlying Surface while it is valid -- between SurfaceHolder.Callback#surfaceCreated and SurfaceHolder.Callback#surfaceDestroyed.
zh_cn: 你必须确保绘制线程仅在其有效时触及底层 Surface - 在 SurfaceHolder.Callback#surfaceCreated 和 SurfaceHolder.Callback#surfaceDestroyed。

source: You must handle every Exception in your code in a principled way; the specific handling varies depending on the case.
zh_cn: 你必须有原则地处理代码中的每个异常；具体处理方式因情况而异。

source: You must handle the padding values when you calculate your view's size.
zh_cn: 在计算 view 大小时，必须处理 padding 值。

source: You must provide a Tokenizer to distinguish the various substrings.
zh_cn: 你必须提供 Tokenizer 以区分各种子字符串。

source: You must specify a child element of <paths> for each directory that contains files for which you want content URIs.
zh_cn: 你必须为每个包含你需要 content URI 的文件的目录指定 <paths> 的子元素。

source: You need to use an AutoCompleteTextView instead of a TextInputEditText as the input text child, and a Widget.MaterialComponents.TextInputLayout.(...).ExposedDropdownMenu style.
zh_cn: 你需要使用 AutoCompleteTextView 而不是 TextInputEditText 作为输入文本子项和 Widget.MaterialComponents.TextInputLayout.(...).ExposedDropdownMenu 样式。

source: You should never fix this issue by calling holder.itemView.setHasTransientState(false); unless you've previously called holder.itemView.setHasTransientState(true);.
zh_cn: 除非你以前调用过 holder.itemView.setHasTransientState(true);，否则你 不应该 通过调用 holder.itemView.setHasTransientState(false); 来解决此问题。

source: You should add a listener via addOnTabSelectedListener(OnTabSelectedListener) to be notified when any tab's selection state has been changed.
zh_cn: 你应该通过 addOnTabSelectedListener(OnTabSelectedListener) 添加一个监听器，以便在任何选项卡的选择状态发生更改时得到通知。

source: You should always prefer to end or cancel animations that are triggering the transient state instead of handling it manually.
zh_cn: 你应该始终希望结束或取消触发瞬态的动画，而不是手动处理它。

source: You should log only what is needed to gather enough information about what is going on about your component.
zh_cn: 你应该只记录收集有关组件的足够信息所需的信息。

source: You should never make assumptions about the size of your view on the screen.
zh_cn: 你永远不应该在屏幕上对 view 的大小做出假设。

source: You should not call methods that perform these actions on views yourself unless you are actually implementing a ViewGroup.
zh_cn: 你不应在 view 中调用方法来执行这些操作，除非你实际上继承了一个 ViewGroup。

source: You should redefine mtrl_on_surface_emphasis_medium to be #99FF0000.
zh_cn: 你应该将 mtrl_on_surface_emphasis_medium 重新定义为 #99FF0000。

source: You should specify a content description for the icon.
zh_cn: 你应该为图标指定内容描述。

source: You should specify a drawable and content description for the icon.
zh_cn: 你应该为图标指定 drawable 和内容描述。

source: You should still always use the returned Bitmap of the decode method and not assume that reusing the bitmap worked, due to the constraints outlined above and failure situations that can occur.
zh_cn: 由于上述限制和可能发生的故障情况，你仍应始终使用解码方法返回的位图，并且不要假定重用位图有效。

source: You supply an implementation of a PagerAdapter to generate the pages that the view shows.
zh_cn: 你提供了 PagerAdapter 的实现，以生成 view 显示的页面。

source: You typically won't use many methods directly on this object.
zh_cn: 你通常不会直接在此对象上使用许多方法。

source: You use the predefined constants to read the attributes from the TypedArray.
zh_cn: 你可以使用预定义常量从 TypedArray 中读取属性。

source: You will almost certainly want to override onMeasure() and are also likely to need to override onDraw() if you want the component to show something.
zh_cn: 如果你想要你的组伯显示一些东西，几乎可以肯定你需要重写 onMeasure() 和 onDraw() 方法。

source: You will probably want to create your own event listeners, property accessors and modifiers, and possibly more sophisticated behavior in your component class as well.
zh_cn: 你也可以在你的组件类中创建自己的事件监听器，属性的获取、设置方法，也可能更复杂的行为。

source: You will receive the down event here.
zh_cn: 你将在这里收到 down 事件。

source: Your APK can contain content that users download but never use, like regional or language information.
zh_cn: 你的 APK 可以包含用户下载但从不使用的内容，例如区域或语言信息。

source: Your activity must extend FragmentActivity
zh_cn: 你的 activity 必须继承 FragmentActivity

source: Your app may waste time during startup if your Application subclasses perform initializations that don’t need to be done yet.
zh_cn: 如果你的应用程序子类执行不需要执行的初始化，则你的应用程序可能会在启动期间浪费时间。

source: Your app’s initial onCreate() function.
zh_cn: 你的应用的初始 onCreate() 函数。

source: Your component's onMeasure() method should calculate a measurement width and height which will be required to render the component.
zh_cn: 你的组件的 onMeasure() 方法将计算出一个测量的宽度和高度，以用来呈现该组件。

source: Your custom view can also extend View directly, or you can save time by extending one of the existing view subclasses, such as Button.
zh_cn: 你的自定义 view 也可以直接继承 View，或者你可以通过继承其中一个现有 view 子类来节省时间，例如 Button。

source: Your custom view should support the widest range of users.
zh_cn: 你的自定义 view 应该支持最广泛的用户。

source: Your image is converted immediately.
zh_cn: 你的图像会立即转换。

source: Your images are converted in place in their original location.
zh_cn: 你的图像会在原始位置转换。

source: Your terminal window should also display the following:
zh_cn: 你的终端窗口还应显示以下内容：

source: Your theme's ?attr/colorControlActivated, ?attr/colorSurface, and ?attr/colorOnSurface must be set.
zh_cn: 必须设置主题的 ?attr/colorControlActivated，?attr/colorSurface 和 ?attr/colorOnSurface。

source: a ViewHolder that can be re-used for this position.
zh_cn: 可以被重用于该位置的 ViewHolder。

source: a float value, representing a ratio between width and height
zh_cn: 浮点值，表示宽度与高度之间的比例。

source: a logical type and that its value should be one of the explicitly
zh_cn: 表示一个逻辑类型，并且它的值应该是显示指明的常量之一。

source: a new Source object, which can be passed to decodeDrawable or decodeBitmap.
zh_cn: 一个新的 Source 对象，可以传递给 decodeDrawable 或 decodeBitmap。

source: a ratio in the form "width:height"
zh_cn: "width:height" 形式的比例

source: abort - we have a deadline we can't meet
zh_cn: 中止 - 我们有一个最后期限，我们不能满足

source: adapter position: Position of an item in the adapter.
zh_cn: adapter position (适配器位置): item 在 adapter 中的位置。

source: added in API level 19
zh_cn: 添加于 API level 19

source: added in API level 28
zh_cn: 添加于 API level 28

source: alpha property of the view, as a value between 0 (completely transparent) and 1 (completely opaque).
zh_cn: view 的 alpha 属性，作为 0(完全透明)和 1(完全不透明)之间的值。

source: an array of StackTraceElement, each represents one stack frame.
zh_cn: 一个 StackTraceElement 数组，每一个元素表示一个堆栈帧。

source: an exact number
zh_cn: 一个精确的数字

source: an instance of ViewGroup.LayoutParams or one of its descendants
zh_cn: ViewGroup.LayoutParams 的一个实例或其后代之一

source: and
zh_cn: 和

source: and the actual permission requirement for this particular intent is described on the Intent name itself:
zh_cn: 对这个特定意图的实际权限要求是在 intent 名称本身上描述的：

source: and this is acceptable:
zh_cn: 同样也接受以下样式：

source: and this is not correct:
zh_cn: 错误示例如下：

source: attributes:
zh_cn: 属性：

source: base z depth of the view.
zh_cn: view 基于 z 的深度。

source: but this is not acceptable:
zh_cn: 但不接受以下样式：

source: cached views should not be flagged as changed because this will cause them to animate when they are returned from cache.
zh_cn: 缓存 view 不应标记为已更改，因为这将导致它们在从缓存返回时动画化。

source: childIndex points into presorted list, find original index
zh_cn: childIndex 指向预先排序的列表，查找原始索引

source: clockwise
zh_cn: 顺时针

source: counter-clockwise
zh_cn: 逆时针

source: dispatching OnClickListener calls
zh_cn: 分发 OnClickListener 调用
